Repository: defnguyen/snaptik
Catalog: lib/l10n/app_*.arb
Languages: fil

source: Download
fil: I-download

source: Enter TikTok URL
fil: Ilagay ang TikTok URL

# howToUseTitle
source: How to Use:
fil: Paano gamitin:

# howToUseStep1
source: 1. Open TikTok and find the video you want to download.
fil: 1. Buksan ang TikTok at hanapin ang video na gusto mong i-download.

# howToUseStep2
source: 2. Tap the 'Share' icon on the right side of the video.
fil: 2. I-tap ang 'Share' icon sa kanan ng video.

# howToUseStep3
source: 3. Choose 'Copy link'.
fil: 3. Piliin ang 'Copy link'.

# howToUseStep4
source: 4. Paste the link into the input field above and tap 'Download'.
fil: 4. I-paste ang link sa input field sa taas at i-tap ang 'Download'.

# invalidUrlError
source: Invalid TikTok URL format.
fil: Hindi valid ang TikTok URL format.

source: Fetching media...
fil: Kinukuha ang media...

source: Download Photo
fil: I-download ang Larawan

source: Download Video
fil: I-download ang Video

# downloadVoice
source: Download Music
fil: I-download ang Musika

source: Download MP3
fil: I-download ang MP3

source: Downloading...
fil: Nag-d-download...

# downloadSuccess
source: Download complete!
fil: Tapos na ang download!

# downloadError
source: Download failed. Please try again.
fil: Hindi nag-download. Subukan ulit.

# downloadLimitReachedTitle
source: Download Limit Reached
fil: Naabot na ang Download Limit

# downloadLimitReachedMessage
source: You have reached the download limit ({limit} times). Watch a short ad to get 5 more download attempts.
fil: Naabot mo na ang download limit ({limit} beses). Manood ng maikling ad para sa 5 pang download attempts.

source: Watch Ad
fil: Manood ng Ad

# photosTab
source: Photos
fil: Mga Larawan

# videosTab
source: Videos
fil: Mga Video

# musicTab
source: Music
fil: Musika

source: View
fil: Tingnan

source: Rename
fil: Palitan ang pangalan

source: Share
fil: I-share

source: Delete
fil: I-delete

# fileName
source: Name
fil: Pangalan

source: Date Added
fil: Petsa ng Pagdagdag

# fileSize
source: Size
fil: Laki

# renameMediaTitle
source: Rename Media
fil: Palitan ang Pangalan ng Media

source: Enter new name
fil: Ilagay ang bagong pangalan

source: Save
fil: I-save

# deleteConfirmationTitle
source: Confirm Delete
fil: Kumpirmahin ang Pag-delete

# deleteConfirmationMessage
source: Are you sure you want to delete this file? This action cannot be undone.
fil: Sigurado ka ba na gusto mong i-delete ang file na ito? Hindi mo na ito mababalik.

source: Confirm
fil: Kumpirmahin

# settingsLanguage
source: Language
fil: Wika

# settingsThemeLight
source: Light
fil: Maliwanag

# settingsThemeDark
source: Dark
fil: Madilim

# settingsClaimMoreDownloads
source: Get 5 More Downloads
fil: Kumuha ng 5 Pang Downloads

# settingsClaimSuccess
source: Success! You have 5 more downloads.
fil: Success! May 5 ka pang downloads.

# settingsClaimError
source: Failed to load ad. Please try again later.
fil: Hindi na-load ang ad. Subukan mo ulit mamaya.

# settingsPremium
source: Upgrade to Premium
fil: Mag-upgrade sa Premium

# settingsPremiumDescription
source: Remove ads and get unlimited downloads.
fil: Tanggalin ang mga ads at makakuha ng unlimited downloads.

# settingsRestorePurchase
source: Restore Purchase
fil: I-restore ang Purchase

# settingsRestoreSuccess
source: Purchases restored successfully!
fil: Matagumpay na na-restore ang mga purchases!

# settingsRestoreError
source: Failed to restore purchases. No active subscription found or error occurred.
fil: Hindi na-restore ang mga purchases. Walang nahanap na active subscription o may error.

# settingsSupportSection
source: Support & Feedback
fil: Support at Feedback

# settingsAbout
source: About
fil: Tungkol

# settingsContact
source: Contact Us
fil: Makipag-ugnayan

# settingsRateApp
source: Rate this App
fil: I-rate ang App na ito

# settingsShareApp
source: Share this App
fil: I-share ang App na ito

# aboutTitle
source: About TikTok Downloader
fil: Tungkol sa TikTok Downloader

# aboutContent
source: This app helps you download public videos, photos, and audio from TikTok posts. Please respect copyright and privacy. Only download content you have permission to use.
fil: Tinutulungan ka ng app na ito na i-download ang mga public videos, photos, at audio mula sa TikTok posts. Pakigarang ang copyright at privacy. I-download lang ang content na may permiso kang gamitin.

# contactTitle
source: Contact Us
fil: Makipag-ugnayan

# contactNameHint
source: Your Name
fil: Ang Inyong Pangalan

# contactEmailHint
source: Your Email
fil: Ang Inyong Email

# contactMessageHint
source: Your Message
fil: Ang Inyong Mensahe

# contactSendButton
source: Send Message
fil: Ipadala ang Mensahe

# contactSending
source: Sending...
fil: Nagipadala...

# contactSuccess
source: Message sent successfully! We will get back to you soon.
fil: Matagumpay na naipadala ang mensahe! Babalikan ka namin kaagad.

# contactError
source: Failed to send message. Please try again later.
fil: Hindi naipadala ang mensahe. Subukan mo ulit mamaya.

# permissionRequiredTitle
source: Permission Required
fil: Kailangan ng Permission

# permissionStorageDenied
source: Storage permission is required to save downloaded files. Please grant the permission in settings.
fil: Kailangan ng storage permission para ma-save ang mga na-download na files. Bigyan ng permission sa settings.

# permissionPhotosDenied
source: Photos permission is required to save downloaded files (iOS). Please grant the permission in settings.
fil: Kailangan ng photos permission para ma-save ang mga na-download na files (iOS). Bigyan ng permission sa settings.

# permissionNotificationDenied
source: Notification permission is recommended for download progress updates.
fil: Nirerekomenda ang notification permission para sa download progress updates.

# permissiongoToSettings
source: Go to Settings
fil: Pumunta sa Settings

source: Upgrade Now
fil: Mag-upgrade Ngayon

source: Choose Your Plan
fil: Piliin ang Inyong Plan

# planWeekly
source: Weekly
fil: Lingguhan

# planMonthly
source: Monthly
fil: Buwanan

# planAnnually
source: Annually
fil: Taunan

# planLifetime
source: Lifetime
fil: Habambuhay

source: One-Time Purchase
fil: Isang Beses lang na Pagbili

source: Save {percent}%
fil: Makatipid ng {percent}%

source: Best Value
fil: Pinakamainam na Halaga

# selectPlanErrorTitle
source: Error Loading Plans
fil: Error sa Pag-load ng mga Plan

# selectPlanErrorMessage
source: Could not load subscription plans. Please check your internet connection and try again.
fil: Hindi ma-load ang mga subscription plans. Tignan ang internet connection at subukan ulit.

source: Purchase Failed
fil: Hindi Naging Matagumpay ang Pagbili

source: Purchase Cancelled
fil: Na-cancel ang Pagbili

source: Purchase Pending
fil: Naghihintay ang Pagbili

# purchaseSuccess
source: Purchase Successful!
fil: Matagumpay ang Pagbili!

# alreadyPremium
source: You are already a Premium user.
fil: Premium user ka na.

source: Get Premium
fil: Kumuha ng Premium

# downloadsRemainingMessage
source: Downloads remaining: {currentLimit}. You can get free downloads by watching ads
fil: Natitirang downloads: {currentLimit}. Makakakuha ka ng free downloads sa pamamagitan ng panonood ng ads

# unlockSaveVideoPro
source: Unlock Premium Features
fil: I-unlock ang Premium Features

source: No Ads & Unlock all features
fil: Walang Ads at I-unlock lahat ng features

# removeAds
source: Remove all ads
fil: Tanggalin lahat ng ads

# tiktokDownloads
source: Unlimited HD downloads of videos, photos, and music from TikTok
fil: Unlimited HD downloads ng videos, photos, at music mula sa TikTok

# instagramDownloads
source: High quality downloads with no watermarks
fil: Mataas na kalidad na downloads na walang watermarks

source: Only buy once
fil: Bumili lang ng isang beses

# perYear
source: /year
fil: /taon

# perMonth
source: /month
fil: /buwan

# perWeek
source: /week
fil: /linggo

source: Most popular
fil: Pinakasikat

source: Buy now
fil: Bumili ngayon

source: Loading plans...
fil: Nilo-load ang mga plans...

source: Failed to load plans
fil: Hindi na-load ang mga plans

source: Retry
fil: Subukan Ulit

# freeTrialDays
source: {days} days free trial
fil: {days} arawng libreng trial

# freeTrialWeeks
source: {weeks} weeks free trial
fil: {weeks} linggong libreng trial

# freeTrialMonths
source: {months} months free trial
fil: {months} buwang libreng trial

source: Supported Platforms
fil: Mga Suportadong Platform

# supportTiktok
source: Download Videos, Images, Music
fil: I-download ang Videos, Images, Music

# supportInstagram
source: High Quality Downloads with No Watermarks
fil: Mataas na kalidad na Downloads na walang Watermarks

# authorsTab
source: Authors
fil: Mga Author

source: Create Playlist
fil: Lumikha ng Playlist

source: Playlist Title
fil: Pamagat ng Playlist

# playlistDescription
source: Description
fil: Paglalarawan

source: Choose Files
fil: Pumili ng mga File

# createPlaylistButton
source: Create Playlist
fil: Lumikha ng Playlist

# playlistTitleHint
source: Enter playlist title
fil: Ilagay ang pamagat ng playlist

# playlistDescriptionHint
source: Enter playlist description (optional)
fil: Ilagay ang paglalarawan ng playlist (optional)

# selectFiles
source: Select files to add to playlist
fil: Pumili ng mga files na idadagdag sa playlist

source: No playlists yet
fil: Walang mga playlist pa

# createFirstPlaylist
source: Create your first playlist to organize your downloads
fil: Lumikha ng inyong unang playlist para ma-organize ang inyong mga downloads

source: No authors yet
fil: Walang mga author pa

# downloadSomethingFirst
source: Download some content to see authors here
fil: Mag-download muna ng content para makita ang mga authors dito

# authorVideos
source: Videos by {author}
fil: Mga video ni {author}

# noVideosFromAuthor
source: No videos from this author yet
fil: Walang mga video pa mula sa author na ito
